In [1]:
import csv
import os
import pandas as pd
# print(os.getcwd())

df = pd.read_csv("salary_dataset.csv")
df.head() # gets first 5 rows

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

Pandas couldn't read my csv file, so i had to get the current working directory(cwd) to make sure i am in the right path. Though it didn't work, so i just closed vs code and opened it again which now worked.

In [ ]:
# save/automatically to/create a new csv file without index
df.to_csv("new_salary_dataset.csv", index=False)

In [ ]:
# import sys
# sys.executable # to check current python interpreter
%pip install openpyxl # % symbol indicates to install on current python environment/interpreter

In [5]:
# read excel file
df = pd.read_excel("salary_dataset.xlsx")
df.head()

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

alright i had issues trying to read an excel file but what i did was to install openpyxl for readig excel files. i had also had i issues trying to pip install with ! (cmd symbol) bc it was installing in a different python interpreter so i had to use % (symbol for installing in current interpreter) which now worked

In [ ]:
# to read csv with selected columns
pd.read_csv("salary_dataset.csv", usecols=["Age", "Salary_USD"])

# read csv and handle missing values
pd.read_csv("salary_dataset.csv", na_values=["?", "NA", "missing"])

# read only first 5 rows
pd.read_csv("salary_dataset.csv", nrows=5)

# read excel specific sheet
pd.read_excel("salary_dataset.xlsx", sheet_name="test_dataset")

name     0
age      0
score    3
dtype: int64

In [ ]:
# Challenge

# load csv
df = pd.read_csv("students.csv")
print(display(df))

# print first 3 rows
# pd.read_csv("students.csv", nrows=3)
df.head(3) # smarter way

# check number of missing values
df.isna().sum()

# select only age and score
pd.read_csv("students.csv", usecols=["age", "score"])

# # remove rows where score is missing
# df = df.dropna()

# # save cleaned data as new csv file
# df.to_csv("students_clean.csv", index=False)

# fill missing values with the mean of entire score column
df.fillna("missing")
df["score"] = df["score"].fillna(df["score"].mean())
df.round(1)

      name  age  score
0    Alice   22   85.0
1      Bob   20    NaN
2  Charlie   21   92.0
3    Diana   23   78.0
4      Eve   19   95.0
5    Frank   24    NaN
6    Grace   22   88.0
7    Henry   20   76.0
8      Ivy   21   91.0
9     Jack   23    NaN

None

      name  age  score
0    Alice   22   85.0
1      Bob   20   86.4
2  Charlie   21   92.0
3    Diana   23   78.0
4      Eve   19   95.0
5    Frank   24   86.4
6    Grace   22   88.0
7    Henry   20   76.0
8      Ivy   21   91.0
9     Jack   23   86.4

the full meaning of csv is comma-separated values

In [ ]:
# homework
# load csv file
df = pd.read_csv("weather.csv")
print(df)

# add a new column
df["temp_f"] = df["temp"] * 1.8 + 32
df

# save clean data
df.to_csv("weather_clean.csv", index=False)

# reload the saved file
df_reload = pd.read_csv("weather_clean.csv")

print("Reloaded from wather_clean.csv:")
df_reload

            city  temp
0          Lagos    30
1          Abuja    28
2  Port Harcourt    31
3           Kano    25
4         Ibadan    29
5          Enugu    27
Reloaded from wather_clean.csv:

            city  temp  temp_f
0          Lagos    30    86.0
1          Abuja    28    82.4
2  Port Harcourt    31    87.8
3           Kano    25    77.0
4         Ibadan    29    84.2
5          Enugu    27    80.6

In [11]:
# 100 days of python

# with open("weather_data.csv") as f:
#     data = f.readlines()
    # print(data)

# with open("weather_data.csv") as data_file:
#     data = csv.reader(data_file)
#     temperatures = []
#     for row in data:
#         if row[1] != "temp":
#             temperatures.append(int(row[1]))
#     print(temperatures)

df = pd.read_csv("weather_data.csv")
df["temp"]

0    12
1    14
2    15
3    14
4    21
5    22
6    24
Name: temp, dtype: int64

In [42]:
# statistics for ML
df = pd.read_csv("salary_dataset.csv")
df = df.head()
print(display(df))

# get summary
df.describe()

# get mean
df[["Age", "Experience_Years", "Bonus_USD", "Work_Hours_Per_Week", "Performance_Score"]].mean() # too long
df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).mean() # smarter way

# get median
df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).median()

# get standard deviation
df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).std()

# get corr
df_corr = df.select_dtypes(include="number").drop(columns=["Employee_ID", "Joining_Year"]).corr()
df_corr["Performance_Score"]

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

None

Age                   -0.754961
Experience_Years       0.056357
Salary_USD            -0.152389
Bonus_USD              0.681975
Work_Hours_Per_Week    0.671793
Performance_Score      1.000000
Name: Performance_Score, dtype: float64

Alright for the correlation part, i figured out that the higher the age -> the higher the salary but doesn't apply to bonus, therefore the work hours per week, performance score and experience years -> the higher the bonus.

In [58]:
# more challenges
df = pd.read_csv("student_scores.csv")
print(df)

# get summary
df.describe()

# get mean score
df.mean() # now smarter
# or
df.select_dtypes(include="number").drop(columns=["hours_studied"]).mean() # less smarter

# get median score
df.median()

# get standard deviation
df.std()

# find corr
df.corr()

    hours_studied  score
0               1     69
1               2     51
2               3     52
3               4     60
4               5     87
5               6     89
6               7     81
7               8    100
8               9    100
9              10    100
10             11    110
11             12    100
12             13    100
13             14    100
14             15    100

               hours_studied     score
hours_studied       1.000000  0.836265
score               0.836265  1.000000

In [93]:
# Encoding categorical data (get_dummies, factorize)
df = pd.read_csv("salary_dataset.csv")
df = df.head()
print(display(df))

# one-Hot Encoding(get_dummies)
Gender_n = pd.get_dummies(df["Gender"], dtype=int)

# Label Encoding (Factorize)
codes, uniques = pd.factorize(df["Gender"])
print(codes)
print(uniques)

# add one-hot encoding to df
df = df.join(Gender_n)
df

# replace label encoding to df
df["Gender"] = codes
df

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type
0,1,Employee_1,58,Female,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time
1,2,Employee_2,48,Female,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time
2,3,Employee_3,34,Male,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time
3,4,Employee_4,27,Male,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract
4,5,Employee_5,40,Male,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time

None
[0 0 1 1 1]
Index(['Female', 'Male'], dtype='object')

,Employee_ID,Name,Age,Gender,Country,City,Education,Job_Title,Department,Experience_Years,Salary_USD,Bonus_USD,Work_Hours_Per_Week,Remote_Work,Performance_Score,Joining_Year,Contract_Type,Female,Male
0,1,Employee_1,58,0,India,NY,Bachelor,Manager,IT,0,130735,3650,41,Yes,1,2015,Part-Time,1,0
1,2,Employee_2,48,0,UK,NY,High School,Designer,HR,4,54363,14600,52,No,2,2022,Part-Time,1,0
2,3,Employee_3,34,1,USA,London,High School,Manager,IT,1,76694,15317,51,Yes,8,2010,Part-Time,0,1
3,4,Employee_4,27,1,UK,Karachi,Bachelor,Developer,Marketing,19,31582,19768,51,Yes,5,2004,Contract,0,1
4,5,Employee_5,40,1,Canada,London,Master,Manager,IT,2,109910,18193,59,Yes,7,2008,Full-Time,0,1

figured out one-hot encoding outputs 2 columns, so best to use df.join() to add it to the df

In [ ]:
# encoding challenge
df = pd.read_csv("customer_data.csv")
print(display(df))

# one-hot encode gender
pd.get_dummies(df["gender"], dtype=int)

# one-hot encode payment
pd.get_dummies(df["payment"], dtype=int)

# combine all encoded columns into df
gender_n  = pd.get_dummies(df["gender"])
df.join(gender_n)
df

# factorize payment
codes, uniques = pd.factorize(df["payment"])
codes
uniques

# replace/add codes for gender using factorize
codes, uniques = pd.factorize(df["gender"])
df["gender"] = codes # to replace
df
df["gender_n"] = codes # to add
df

   gender   payment
0    male      cash
1  female      card
2  female  transfer
3    male      card
4    male      cash
5  female  transfer
6    male  transfer
7  female      cash

None

   gender   payment  gender_n
0       0      cash         0
1       1      card         1
2       1  transfer         1
3       0      card         0
4       0      cash         0
5       1  transfer         1
6       0  transfer         0
7       1      cash         1